def number_to_words(n):
    ones = ["один", "два", "три", "четыре", "пять",
            "шесть", "семь", "восемь", "девять"]
    b_ones = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
              "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
    tens = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят",
            "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
    if n < 10:
        return ones[n-1]
    elif n > 10 and n < 20:
        return b_ones[n-11]
    elif n > 9 and n % 10 == 0:
        return tens[n//10-1]
    elif n > 19 and n % 10 != 0:
        return tens[n//10-1] + " " + ones[n % 10-1]


num = int(input("Введите целове число от 1 до 99: "))
print(number_to_words(num))
