db.articles.insertMany([
	{
		title: "статья 1",
		authors: ["Воробьев Максим Витальевич", "Иванов Петр Михайлович"],
		placement_date: new Date("04.04.2019"),
		content: "это статья под номером 1",
		tags: ["статья 1", "паттерны программирования", "разработка веб-сайтов", "проектирование"],
		reviews: [
			{
				name: "Иван",
				text: "круто!!!",
				mark: 7,
			},
			{
				name: "Александр",
				text: "класс!!!",
				mark: 8,
			},
			{
				name: "Михаил",
				text: "amazing!!!",
				mark: 10,
			},
		]
	},
	{
		title: "статья 2",
		authors: ["Воробьев Максим Витальевич"],
		placement_date: new Date("05.07.2020"),
		content: "это статья под номером 2",
		tags: ["статья 2", "java", "back-end разработка"],
		reviews: [
			{
				name: "Михаил",
				text: "аааааа",
				mark: 7,
			},
			{
				name: "Вячеслав",
				text: "бббббб",
				mark: 7,
			},
		]
	},
	{
		title: "статья 3",
		authors: ["Борисов Иван Евгеньевич", "Клименчук Владислав Сергеевич"],
		placement_date: new Date("11.09.2020"),
		content: "это статья под номером 3",
		tags: ["статья 3", "садоводство", "селекция"],
		reviews: [
			{
				name: "Илья",
				text: "интересная статья",
				mark: 8,
			},
			{
				name: "Мария",
				text: "что-то новое",
				mark: 7,
			},
		]
	},
	{
		title: "статья 4",
		authors: ["Иванов Петр Михайлович"],
		placement_date: new Date("03.05.2021"),
		content: "это статья под номером 4",
		tags: ["статья 4", "спорт", "баскетбол"],
		reviews: [
			{
				name: "Максим",
				text: "уууууу",
				mark: 10,
			},
			{
				name: "Михаил",
				text: "круто!!!!",
				mark: 9,
			},
			{
				name: "Петр",
				text: "даааааа",
				mark: 9,
			},
		]
	},
	{
		title: "статья 5",
		authors: ["Иванов Иван Иванович"],
		placement_date: new Date("07.11.2022"),
		content: "это статья под номером 5",
		tags: ["статья 5", "математика", "экономика и бизнес"],
		reviews: [
			{
				name: "Петр",
				text: "ну сойдет",
				mark: 6,
			},
		]
	},

])